<?php

$lang['required']			= "Поле «%s» обязательно для заполнения.";
$lang['isset']				= "Поле «%s» должно содержать значение.";
$lang['valid_email']		= "Поле «%s» должно содержать правильный адрес электронной почты.";
$lang['valid_emails']		= "Поле «%s» должно содержать правильные адреса электронной почты.";
$lang['valid_url']			= "Поле «%s» должно содержать правильный URL.";
$lang['valid_ip']			= "Поле «%s» должно содержать правильный IP.";
$lang['min_length']			= "Поле «%s» должно быть не короче %s символов.";
$lang['max_length']			= "Поле «%s» должно быть не длиннее %s символов.";
$lang['exact_length']		= "Поле «%s» должно быть точно %s символов в длину.";
$lang['alpha']				= "Поле «%s» должно содержать только буквы.";
$lang['alpha_numeric']		= "Поле «%s» должно содержать только буквы и цифры.";
$lang['alpha_dash']			= "Поле «%s» должно содержать только буквы, цифры, символы подчеркивания и тире.";
$lang['numeric']			= "Поле «%s» должно содержать правильное число.";
$lang['is_numeric']			= "Поле «%s» должно содержать правильное число.";
$lang['integer']			= "Поле «%s» должно содержать целое число.";
$lang['regex_match']		= "Поле «%s» заполнено в неверном формате.";
$lang['matches']			= "Поле «%s» должно соответствовать значению в поле «%s».";
$lang['is_unique'] 			= "Поле «%s» должно содержать уникальное значение.";
$lang['is_natural']			= "Поле «%s» должно содержать положительное число.";
$lang['is_natural_no_zero']	= "Поле «%s» должно содержать число больше нуля.";
$lang['decimal']			= "Поле «%s» должно содержать десятичное число.";
$lang['less_than']			= "Поле «%s» должно содержать число меньшее чем %s.";
$lang['greater_than']		= "Поле «%s» должно содержать число большее чем %s.";

$lang['check_url']		= "Некорректный URL.";
$lang['check_captcha']		= "Неправильный проверочный код.";


/* End of file form_validation_lang.php */
/* Location: ./system/language/english/form_validation_lang.php */